docs/benchmark-results/sync-vs-async/raw/stage2-async-nobatch-k6-logs/insert-only-vu100.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test/large-db-insert-async.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 10m30s max duration (incl. graceful stop):
              * insert_async: 100 iterations for each of 100 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=2.45ms min=0s med=1.52ms max=37.24ms p(90)=4.31ms p(95)=7.16ms 
      { expected_response:true }...: avg=2.45ms min=0s med=1.52ms max=37.24ms p(90)=4.31ms p(95)=7.16ms 
    http_req_failed................: 0.00%  0 out of 10000
    http_reqs......................: 10000  28799.6286/s

    EXECUTION
    iteration_duration.............: avg=3.12ms min=0s med=1.99ms max=44.38ms p(90)=6.59ms p(95)=13.06ms
    iterations.....................: 10000  28799.6286/s

    NETWORK
    data_received..................: 732 kB 2.1 MB/s
    data_sent......................: 1.4 MB 4.1 MB/s



running (00m00.3s), 000/100 VUs, 10000 complete and 0 interrupted iterations
insert_async ✓ [ 100% ] 100 VUs  00m00.3s/10m0s  10000/10000 iters, 100 per VU