docs/benchmark-results/sync-vs-async/raw/stage2-async-nobatch-k6-logs/insert-update-vu200.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test/large-db-insert-then-update-async.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 10m30s max duration (incl. graceful stop):
              * insert_then_update_async: 50 iterations for each of 200 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=5.5ms   min=0s med=4ms    max=89.1ms   p(90)=9.46ms  p(95)=13.73ms
      { expected_response:true }...: avg=5.5ms   min=0s med=4ms    max=89.1ms   p(90)=9.46ms  p(95)=13.73ms
    http_req_failed................: 0.00%  0 out of 20000
    http_reqs......................: 20000  27170.313715/s

    EXECUTION
    iteration_duration.............: avg=13.24ms min=0s med=9.54ms max=122.53ms p(90)=27.55ms p(95)=40.4ms 
    iterations.....................: 10000  13585.156858/s

    NETWORK
    data_received..................: 1.5 MB 2.0 MB/s
    data_sent......................: 3.0 MB 4.0 MB/s



running (00m00.7s), 000/200 VUs, 10000 complete and 0 interrupted iterations
insert_then_update_async ✓ [ 100% ] 200 VUs  00m00.7s/10m0s  10000/10000 iters, 50 per VU